euyju/VibeClean/HW/STM32/Core/Src/main.c
	    // 2. 카운터 변화량 계산 (Delta Pulse) - 랩어라운드 처리 적용
	    int delta_L_pulse = current_enc_L - prev_enc_L;
	    int delta_R_pulse = current_enc_R - prev_enc_R;

	    //  랩어라운드 처리
	    if (delta_L_pulse > (PERIOD / 2)) {
	        delta_L_pulse -= PERIOD; // 언더플로우 발생 시
	    } else if (delta_L_pulse < -(PERIOD / 2)) {
	        delta_L_pulse += PERIOD; // 오버플로우 발생 시
	    }

	    if (delta_R_pulse > (PERIOD / 2)) {
	        delta_R_pulse -= PERIOD;
	    } else if (delta_R_pulse < -(PERIOD / 2)) {
	        delta_R_pulse += PERIOD;
	    }

	    prev_enc_L = current_enc_L;
	    prev_enc_R = current_enc_R;

	    // 3. 펄스 변화량을 실제 이동 거리(mm)로 변환
	    float distance_L_mm = (float)delta_L_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);
	    float distance_R_mm = (float)delta_R_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);

	    // 평균 이동 거리 및 각도 변화 계산
	    float distance_center_mm = (distance_R_mm + distance_L_mm) / 2.0f;
	    float delta_theta_rad = (distance_R_mm - distance_L_mm) / ROBOT_AXLE_LENGTH_MM; // 회전 각도(라디안)


	    // 4. 좌표 (X, Y) 및 방향 (Yaw) 업데이트 (Middle Point 적분 방식 적용)

	    // 4-1. 현재 Yaw를 라디안으로 변환
	    float current_yaw_rad = g_robot_yaw * PI / 180.0f;

	    // 4-2. 중간 각도 (Average Yaw) 계산: X, Y 계산에 사용 (정확도 향상)
	    float avg_yaw_rad = current_yaw_rad + delta_theta_rad / 2.0f;

	    // 4-3. X, Y 좌표 업데이트
	    float delta_x = distance_center_mm * cosf(avg_yaw_rad);
	    float delta_y = distance_center_mm * sinf(avg_yaw_rad);

	    g_robot_x += delta_x;
	    g_robot_y += delta_y;

	    // 4-4. Yaw 각도 업데이트 및 정규화
	    float next_yaw_rad = current_yaw_rad + delta_theta_rad;
	    g_robot_yaw = next_yaw_rad * 180.0f / PI;

	    // Yaw 각도 정규화 (0~359.999도)
	    while (g_robot_yaw >= 360.0f) g_robot_yaw -= 360.0f;
	    while (g_robot_yaw < 0.0f) g_robot_yaw += 360.0f;
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
//Putty 작동 테스트용 변수
	int countL, countR; //  엔코더 카운트 저장 변수
	char debug_msg[100]; // 디버깅 메시지 버퍼

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_I2C1_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  MX_TIM6_Init();
  /* USER CODE BEGIN 2 */
  // DWT 초기화 (마이크로초 측정을 위해 필수)
  DWT_Init();
  UART_Printf("STM32 HC-SR04 Measurement Ready (Trig: PA0, Echo: PA1)\r\n");


  motor_control_init(); // <- 반드시 호출 (PWM Start + 초기화)
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  //엔코더 카운팅 시작
  HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL);
  HAL_TIM_Encoder_Start(&htim8, TIM_CHANNEL_ALL);

  // Edge-AI 초기화
  UART_Printf("\r\n=== VibeClean Edge-AI Test ===\r\n");

  // MPU6050 센서 초기화
  if (MPU6050_Init(&hi2c1) == HAL_OK) {
      UART_Printf("MPU6050 Init: OK (WHO_AM_I = 0x%02X)\r\n", MPU6050_WhoAmI(&hi2c1));
  } else {
      UART_Printf("MPU6050 Init: FAILED!\r\n");
  }

  // Edge Impulse 분류기 초기화
  if (edge_ai_init() == 0) {
      UART_Printf("Edge Impulse Init: OK\r\n");
  } else {
      UART_Printf("Edge Impulse Init: FAILED!\r\n");
  }

  // TIM6 100Hz 인터럽트 시작
  HAL_TIM_Base_Start_IT(&htim6);
  UART_Printf("TIM6 100Hz Timer: Started\r\n");
  UART_Printf("Collecting %d samples (%.1f seconds)...\r\n\r\n",
              EDGE_AI_SAMPLE_COUNT, EDGE_AI_SAMPLE_COUNT / 100.0f);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int failCount = 0;
  int tempAovoid = 0; // 0 = right, 1 = left

  char post_data_buffer[150]; //json 문자열 버퍼

////  MPU6050_Init();
//
//  float d1, d2, d3;
//  int16_t Ax, Ay, Az;
//  char buf[100];
//  // 1️⃣ Wi-Fi 연결
//     ESP_Init("YOUR_WIFI_SSID", "YOUR_WIFI_PASSWORD");
//     char value[64];  // 서버로부터 받은 값을 저장할 버퍼
//
//     // 2️⃣ GET 요청 및 값 파싱
//     if (ESP_HTTP_Get_Value("192.168.178.61", "/api/manual/speed", "fanSpeed", value))
//     {
//         char msg[128];
//         sprintf(msg, "fanSpeed value = %s\r\n", value);
//         Uart_sendstring(msg, &huart2);
//     }
//     else
//     {
//         Uart_sendstring("HTTP GET Failed\r\n", &huart2);
//     }
//
//  // POST
//  ESP_HTTP_Post("192.168.178.61", "/data", "{\"id\":1,\"value\":42}");
//
//  float distance1, distance2, distance3;


  while (1)
  {
      // === IMU 센서 디버깅 출력 (0.1초마다) ===
      if (imu_debug_ready) {
          UART_Printf("[IMU] Ax: %.3fg, Ay: %.3fg, Az: %.3fg\r\n",
                     imu_debug_ax, imu_debug_ay, imu_debug_az);
          imu_debug_ready = 0;  // 플래그 리셋
      }

      // === Edge-AI 테스트 코드 ===
      if (edge_ai_buffer_ready) {
          surface_classification_t result = {0};

          // Edge Impulse 분류기 실행
          if (edge_ai_classify(edge_ai_buffer, EDGE_AI_SAMPLE_COUNT * EDGE_AI_AXES, &result) == 0) {
              // 판별 결과 출력 (Hard, Carpet, Dusty - 대문자 시작)
              UART_Printf("[AI] Hard: %.2f, Carpet: %.2f, Dusty: %.2f\r\n",
                         result.Hard, result.Carpet, result.Dusty);
          } else {
              UART_Printf("[AI] Classification FAILED\r\n");
          }

          // 버퍼 준비 완료 플래그 리셋
          edge_ai_buffer_ready = 0;
      }

      // === 주행 코드 ===
      // 전진 유지
      move_forward_pwm(BASE_SPEED);

      // 초음파 센서로 거리 측정
      float d1 = HCSR04_Read(TRIG_PORT, TRIG_PIN, ECHO_PORT, ECHO_PIN);
      DWT_Delay_us(5000);
      float d2 = HCSR04_Read(TRIG_PORT1, TRIG_PIN1, ECHO_PORT1, ECHO_PIN1);
      DWT_Delay_us(5000);
      float d3 = HCSR04_Read(TRIG_PORT2, TRIG_PIN2, ECHO_PORT2, ECHO_PIN2);

      // UART_Printf("[USS] S1: %.1fcm | S2: %.1fcm | S3: %.1fcm\r\n", d1, d2, d3);

      // 장애물 감지 및 회피
      if ((d1 > 1 && d1 <= WALL_DISTANCE_THRESHOLD)
                || (d2 > 1 && d2 <= WALL_DISTANCE_THRESHOLD)
                || (d3 > 1 && d3 <= WALL_DISTANCE_THRESHOLD)) {
          failCount++;
          if (failCount > 5) { // 연속 5회 이상이면 진짜 장애물
              stop_all_motors();
              HAL_Delay(50);

              UART_Printf("[AVOID] Obstacle detected! Avoiding...\r\n");

              if(tempAovoid == 0){
                 R_avoidance_sequence();
                 tempAovoid = 1;
              }
              else{
                 L_avoidance_sequence();
                 tempAovoid = 0;
              }
              failCount = 0;
          }
      } else {
          failCount = 0;
      }

