euyju/VibeClean/HW/STM32/Core/Src/main.c
      HAL_Delay(100);



//	  	  	  //실제 사용할 2D Mapping 좌표전송 코드 (통신구축 완료 후 수정필요)
//	  		  HAL_Delay(5000);  // 5초마다 재요청 가능
//	          ESP_HTTP_Get_Value("192.168.178.61", "/api/manual/speed", "fanSpeed", value);
//
//	          char msg[128];
//	          sprintf(msg, "fanSpeed = %s\r\n", value);
//	          Uart_sendstring(msg, &huart2);
//
//	          // 1. 오도메트리 업데이트 (좌표 계산)
//	              update_odometry();
//
//	          // 2. 백엔드로 보낼 JSON 데이터 생성
//	              int x_int = (int)roundf(g_robot_x);
//	              int y_int = (int)roundf(g_robot_y);
//
//	          // JSON 형식으로 포맷팅
//	              sprintf(post_data_buffer,
//	                      "{\"robotId\":1,\"x\":%d,\"y\":%d}",
//	                      x_int, y_int);
//
//	          // 3. POST 요청으로 서버에 데이터 전송
//	              ESP_HTTP_Post("192.168.178.61", "/api/robot/location", post_data_buffer);
//
//	          // 4. 전송 주기 설정
//	              HAL_Delay(100); // 100ms (0.1초) 주기로 전송


//     MPU6050_Read_Accel(&Ax, &Ay, &Az);
//
//         // g 단위 변환
//         float ax_g = Ax / 16384.0f;
//         float ay_g = Ay / 16384.0f;
//         float az_g = Az / 16384.0f;
//
//         // Roll / Pitch 계산
//         float roll  = atan2f(ay_g, az_g) * 180.0f / 3.14159265f;
//         float pitch = atan2f(-ax_g, sqrtf(ay_g*ay_g + az_g*az_g)) * 180.0f / 3.14159265f;
//
//         // UART로 출력
//         char buf[100];
//         sprintf(buf, "Roll: %.2f  Pitch: %.2f\r\n", roll, pitch);
//         HAL_UART_Transmit(&huart2, (uint8_t*)buf, strlen(buf), 1000);
//
//         HAL_Delay(500);
//      //전진 유지
//     move_forward_pwm(BASE_SPEED);
//
//         d1 = HCSR04_Read(TRIG_PORT, TRIG_PIN, ECHO_PORT, ECHO_PIN);
//         DWT_Delay_us(5000);
//         d2 = HCSR04_Read(TRIG_PORT1, TRIG_PIN1, ECHO_PORT1, ECHO_PIN1);
//         DWT_Delay_us(5000);
//         d3 = HCSR04_Read(TRIG_PORT2, TRIG_PIN2, ECHO_PORT2, ECHO_PIN2);
//
//         UART_Printf("S1: %.1f cm | S2: %.1f cm | S3: %.1f cm\r\n", d1, d2, d3);
//
//         // 센서값 모두 0이면 일시적인 에러로 간주
//         if ((d1 > 1 && d1 <= WALL_DISTANCE_THRESHOLD)
//                   || (d2 > 1 && d2 <= WALL_DISTANCE_THRESHOLD)
//                   || (d3 > 1 && d3 <= WALL_DISTANCE_THRESHOLD)) {
//             failCount++;
//             if (failCount > 5) { // 연속 3회 이상이면 진짜 장애물일 수도 있음
//                 stop_all_motors();
//                 HAL_Delay(50);
//                 if(tempAovoid == 0){
//                    R_avoidance_sequence();
//                    tempAovoid = 1;
//                 }
//                 else{
//                    L_avoidance_sequence();
//                    tempAovoid = 0;
//
//                 }
//                 failCount = 0;
//             }
//         } else {
//             failCount = 0;
//         }
//
//
//         HAL_Delay(100);
//
//

     /* USER CODE BEGIN WHILE */


//      모터 c 전진 2s
//         set_motor_direction(MOTOR_C, FORWARD);
//
//         set_motor_speed(MOTOR_C, 900);
//
//         HAL_Delay(3000);
//
//         set_motor_speed(MOTOR_C, 0);
//         HAL_Delay(500);
//
//      모터 A 전진 2s
//         set_motor_direction(MOTOR_A, FORWARD);
//         set_motor_direction(MOTOR_B, FORWARD);
//
//         set_motor_speed(MOTOR_A, 400);
//         set_motor_speed(MOTOR_B, 400);
//
//         HAL_Delay(1000);
//
//         set_motor_speed(MOTOR_A, 0);
//         HAL_Delay(500);
//
//         // 모터 A 후진 2s
//         set_motor_direction(MOTOR_A, BACKWARD);
//         set_motor_direction(MOTOR_B, BACKWARD);
//
//         set_motor_speed(MOTOR_A, 400);
//         set_motor_speed(MOTOR_B, 400);
//
//         HAL_Delay(1000);
//
//         set_motor_speed(MOTOR_A, 0);
//         set_motor_speed(MOTOR_B, 0);
//
//         HAL_Delay(1000);
//
//      센서 1에서 거리 읽기
//         distance1 = HCSR04_Read(TRIG_PORT, TRIG_PIN, ECHO_PORT, ECHO_PIN);
//
//         // 센서 2에서 거리 읽기
//         distance2 = HCSR04_Read(TRIG_PORT1, TRIG_PIN1, ECHO_PORT1, ECHO_PIN1);
//
//         // 센서 2에서 거리 읽기
//         distance3 = HCSR04_Read(TRIG_PORT2, TRIG_PIN2, ECHO_PORT2, ECHO_PIN2);
//
//         // 결과 출력
//         if (distance1 > 0)
//             UART_Printf("S1: %.2f cm  ", distance1);
//         else
//             UART_Printf("S1: Fail  ");
//
//         if (distance2 > 0)
//             UART_Printf("S2: %.2f cm  ", distance2);
//         else
//             UART_Printf("S2: Fail\r\n");
//
//         if (distance3 > 0)
//                      UART_Printf("S3: %.2f cm\r\n", distance3);
//                  else
//                      UART_Printf("S3: Fail\r\n");
//
//         HAL_Delay(500);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 50;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

